Documents/ИнвентаризацияРасчетовСконтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ИнвентаризацияРасчетовСконтрагентами</Name>
			<Comment>(Регл) Акт инвентаризации расчетов с покупателями, поставщиками и прочими дебиторами и кредиторами</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПроведенияИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВид</Name>
					<Comment>Документ-основание для проведения инвентаризации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ) Контрагент, в расчетах с которым возникла задолженность</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подтверждено</Name>
							<Comment>Подтвержденная сумма задолженности</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПодтверждено</Name>
							<Comment>Не подтвержденная сумма задолженности</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИстекСрокДавности</Name>
							<Comment>Сумма задолженности, по которой истек срок давности</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаРасчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗадолженности</Name>
			<Comment>Виды задолженности: дебиторская, кредиторская</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
					<Comment>Дебиторская</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
					<Comment>Кредиторская</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвентаризацияРасчетовСконтрагентами/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//	Процедура выполняет заполнение документа по форме ИНВ-17 данными регистра БУ
//
//	Аргументы:	1.	аргВидЗадолженности 
// 	Тип:	 		Перечисления.ВидыЗадолженности
//	Назначение:     Формирование выборки по конкретному виду задолженности (опция)
//
// 				2.	СписокСчетовВАкт
// 	Тип:			Массив
//	Назначение:     Формирование выборки по счетам (обязательный аргумент)
//
Процедура ЗаполнитьАктДляИнв17(ВидЗадолженности = Неопределено) Экспорт
	
	// Проверка требования на отбор данных по виду задолженности
	Если НЕ (ВидЗадолженности = Неопределено) Тогда
		// Вид задолженности выбран
		// Выполнение очистки записей ТЧ Контрагенты по виду задолженности
		СтруктураОтбора = Новый Структура("ВидЗадолженности", ВидЗадолженности);
		УдаляемыеСтроки = Контрагенты.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Контрагенты.Удалить(УдаляемаяСтрока);
		КонецЦикла;
	Иначе
		// Полная очистка записей в ТЧ Контрагенты
		Контрагенты.Очистить();
	КонецЕсли;
	
	Запрос 		= Новый Запрос;
	ГраницаАкта = Новый Граница(КонецДня(Дата), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("Дата",        	  ГраницаАкта);
	Запрос.УстановитьПараметр("Организация", 	  Организация);
	МассивСчетов = СчетаРасчетов.ВыгрузитьКолонку("СчетРасчетов");
	МассивСчетов = УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивСчетов);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Запрос.УстановитьПараметр("ВидЗадолженности",  	ВидЗадолженности);
	Запрос.УстановитьПараметр("Дебиторская",  Перечисления.ВидыЗадолженности.Дебиторская);
	Запрос.УстановитьПараметр("Кредиторская", Перечисления.ВидыЗадолженности.Кредиторская);
	Запрос.УстановитьПараметр("Активный", ВидСчета.Активный);
	Запрос.УстановитьПараметр("Пассивный", ВидСчета.Пассивный);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Счет КАК СчетРасчетов,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет.Вид = &Активный
	|					ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстатокДт
	|			ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокКт
	|		КОНЕЦ) КАК Подтверждено,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = &Активный
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА &Дебиторская
	|		ИНАЧЕ &Кредиторская
	|	КОНЕЦ КАК ВидЗадолженности
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В (&МассивСчетов), &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	(&ВидЗадолженности = НЕОПРЕДЕЛЕНО
	|			ИЛИ ВЫБОР
	|				КОГДА ХозрасчетныйОстатки.Счет.Вид = &Активный
	|						ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|					ТОГДА &Дебиторская
	|				ИНАЧЕ &Кредиторская
	|			КОНЕЦ = &ВидЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Счет.Вид = &Активный
	|				ИЛИ ХозрасчетныйОстатки.СуммаОстатокДт > 0
	|			ТОГДА &Дебиторская
	|		ИНАЧЕ &Кредиторская
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1.Представление,
	|	ХозрасчетныйОстатки.Счет.Порядок";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока (Выборка.Следующий()) Цикл
		СтрокаДанных = Контрагенты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьАктДляИнв17()
                                                                       
//	Процедура выполняет формирование и вывод итоговых значений документа
//	в форме
//
//	Аргументы:	ОбъектФорма - форма документа, выполнившая вызов функции
//
Функция ПолучитьИтоги() Экспорт
	
	ТабКонтрагентыДт = Контрагенты.Выгрузить();
	ТабКонтрагентыКт = ТабКонтрагентыДт.Скопировать();
	
	ОтборДт	 = Новый Структура("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
	ОтборКт	 = Новый Структура("ВидЗадолженности", Перечисления.ВидыЗадолженности.Кредиторская);
	мИтогиДт = ТабКонтрагентыДт.НайтиСтроки(ОтборКт);
	мИтогиКт = ТабКонтрагентыКт.НайтиСтроки(ОтборДт);
	
	Для Каждого ЭлмИтогиДт Из мИтогиДт Цикл
		ТабКонтрагентыДт.Удалить(ЭлмИтогиДт);
	КонецЦикла;
	
	Для Каждого ЭлмИтогиКт Из мИтогиКт Цикл
		ТабКонтрагентыКт.Удалить(ЭлмИтогиКт);
	КонецЦикла;
	
	СуммаДт = 	ТабКонтрагентыДт.Итог("Подтверждено")	+ 
				ТабКонтрагентыДт.Итог("НеПодтверждено");
				
	СуммаКт = 	ТабКонтрагентыКт.Итог("Подтверждено")	+ 
				ТабКонтрагентыКт.Итог("НеПодтверждено");
	
	ТекстИтогиДт = НСтр("ru='Всего строк:';uk='Усього рядків:'") + Символы.НПП	+ ТабКонтрагентыДт.Количество() + Символы.Таб + 
	НСтр("ru='Всего, грн.:';uk='Усього, грн.:'") + Символы.НПП + 
	Формат(СуммаДт, "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ НСтр("ru='подтверждено:';uk='підтверджено:'") + Символы.НПП + 
	Формат(ТабКонтрагентыДт.Итог("Подтверждено"), "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ 
	НСтр("ru='не подтверждено:';uk='не підтверджено:'") + Символы.НПП + 
	Формат(ТабКонтрагентыДт.Итог("НеПодтверждено"), "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ 
	НСтр("ru='истек срок давности:';uk='минув строк давнини:'") + Символы.НПП + 
	Формат(ТабКонтрагентыДт.Итог("ИстекСрокДавности"), "ЧЦ=15; ЧДЦ=2; ЧН=-");
	
	ТекстИтогиКт = НСтр("ru='Всего строк:';uk='Усього рядків:'") + Символы.НПП	+ ТабКонтрагентыКт.Количество() + Символы.Таб + 
	НСтр("ru='Всего, грн.:';uk='Усього, грн.:'") + Символы.НПП + 
	Формат(СуммаКт, "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ НСтр("ru='подтверждено:';uk='підтверджено:'") + Символы.НПП + 
	Формат(ТабКонтрагентыКт.Итог("Подтверждено"), "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ 
	НСтр("ru='не подтверждено:';uk='не підтверджено:'") + Символы.НПП + 
	Формат(ТабКонтрагентыКт.Итог("НеПодтверждено"), "ЧЦ=15; ЧДЦ=2; ЧН=-") + Символы.Таб	+ 
	НСтр("ru='истек срок давности:';uk='минув строк давнини:'") + Символы.НПП + 
	Формат(ТабКонтрагентыКт.Итог("ИстекСрокДавности"), "ЧЦ=15; ЧДЦ=2; ЧН=-");
	
	ТекстИтогиДт = ?(ТабКонтрагентыДт.Количество() = 0,
					НСтр("ru='Документ по дебиторской задолженности не заполнен.';uk='Документ по дебіторській заборгованості не заповнений.'"),
					ТекстИтогиДт);

	ТекстИтогиКт = ?(ТабКонтрагентыКт.Количество() = 0,
					НСтр("ru='Документ по кредиторской задолженности не заполнен.';uk='Документ по кредиторській заборгованості не заповнений.'"),
					ТекстИтогиКт);

	Возврат Новый Структура("СтрокаДт,СтрокаКт", ТекстИтогиДт,ТекстИтогиКт);
	
КонецФункции // ПолучитьИтоги()

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ПЕЧАТНЫХ ФОРМ

# Если Клиент Тогда
	
Процедура ВыполнитьЗапросыДляПечати(КодЯзыкаПечать,ЗаголовокРазделаПодписей,Выборка,ВыборкаПоКомиссии,РезультатКонтрагенты)
		
	КодЯзыкаПечать = 
	  Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
	                                                  "РежимФормированияПечатныхФорм"));
	
	// Варианты заголовков разделов с подписями печатной формы	
	ЗаголовокРазделаПодписей = Новый Структура();
	ЗаголовокРазделаПодписей.Вставить("ПредседательКомиссии", НСтр("ru='Председатель комиссии';uk='Голова комісії'", КодЯзыкаПечать) );
	ЗаголовокРазделаПодписей.Вставить("ЧленыКомиссии", НСтр("ru='Члены комиссии';uk='Члени комісії'", КодЯзыкаПечать) );
	
	//	Данные для шапки акта
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инвентаризация.Дата КАК Дата,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.ДатаНачалаИнвентаризации КАК ДатаНачалаИнвентаризации,
	|	Инвентаризация.ДатаОкончанияИнвентаризации КАК ДатаОкончанияИнвентаризации,
	|	Инвентаризация.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	Инвентаризация.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	Инвентаризация.ДокументОснованиеНомер КАК ДокументОснованиеНомер
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСконтрагентами КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка";  
	
	Выборка= Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	
	//	Данные строк таблиц
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Ссылка);
	
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ
	|	Инвентаризация.ВидЗадолженности КАК ВидЗадолженности,
	|	Инвентаризация.Контрагент КАК Контрагент,
	|	Инвентаризация.Контрагент.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	ПОДСТРОКА(Инвентаризация.Контрагент.НаименованиеПолное, 1, 200) КАК КонтрагентНаименованиеПолное,
	|	Инвентаризация.Контрагент.Наименование КАК КонтрагентНаименование,
	|	Инвентаризация.СчетРасчетов КАК СчетРасчетов,
	|	ПРЕДСТАВЛЕНИЕ(Инвентаризация.СчетРасчетов) КАК СчетРасчетовПредставление,
	|	СУММА(Инвентаризация.Подтверждено + Инвентаризация.НеПодтверждено) КАК Всего,
	|	СУММА(Инвентаризация.Подтверждено) КАК Подтверждено,
	|	СУММА(Инвентаризация.НеПодтверждено) КАК НеПодтверждено,
	|	СУММА(Инвентаризация.ИстекСрокДавности) КАК ИстекСрокДавности
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСконтрагентами.Контрагенты КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Инвентаризация.ВидЗадолженности,
	|	Инвентаризация.Контрагент,
	|	ПОДСТРОКА(Инвентаризация.Контрагент.НаименованиеПолное, 1, 200),
	|	Инвентаризация.СчетРасчетов,
	|	Инвентаризация.Контрагент.Наименование,
	|	Инвентаризация.Контрагент.КодПоЕДРПОУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименование,
	|	Инвентаризация.СчетРасчетов.Порядок
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ИстекСрокДавности)
	|ПО
	|	ВидЗадолженности";
	
	РезультатКонтрагенты = ЗапросКонтрагенты.Выполнить();
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной.
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьИнвентаризации_2015()
	
	Перем КодЯзыкаПечать, ЗаголовокРазделаПодписей, Выборка, ВыборкаПоКомиссии, РезультатКонтрагенты;
	
	ВыполнитьЗапросыДляПечати(КодЯзыкаПечать,ЗаголовокРазделаПодписей,Выборка,ВыборкаПоКомиссии,РезультатКонтрагенты);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("Инвентаризация2015");
	
	Макет.КодЯзыкаМакета = КодЯзыкаПечать; 	 
	
	// Формирование шапки
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Выборка);
	
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата);
	
	Шапка.Параметры.Организация  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,    "ПолноеНаименование,",Ложь,КодЯзыкаПечать);
	КодЕДРПОУ = СокрЛП(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,    "КодПоЕДРПОУ,",Ложь,КодЯзыкаПечать));
	
	Если Не ПустаяСтрока(КодЕДРПОУ) И СтрДлина(КодЕДРПОУ) = 8 Тогда
		Шапка.Параметры.КодЕДРПОУ1 = Сред(КодЕДРПОУ, 1, 1);
		Шапка.Параметры.КодЕДРПОУ2 = Сред(КодЕДРПОУ, 2, 1);
		Шапка.Параметры.КодЕДРПОУ3 = Сред(КодЕДРПОУ, 3, 1);
		Шапка.Параметры.КодЕДРПОУ4 = Сред(КодЕДРПОУ, 4, 1);
		Шапка.Параметры.КодЕДРПОУ5 = Сред(КодЕДРПОУ, 5, 1);
		Шапка.Параметры.КодЕДРПОУ6 = Сред(КодЕДРПОУ, 6, 1);
		Шапка.Параметры.КодЕДРПОУ7 = Сред(КодЕДРПОУ, 7, 1);
		Шапка.Параметры.КодЕДРПОУ8 = Сред(КодЕДРПОУ, 8, 1);
	КонецЕсли;

	Шапка.Параметры.НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
	Шапка.Параметры.ДеньДокумента  = День(Выборка.Дата);
	
	Шапка.Параметры.МесяцДокумента = Сред(Формат(Выборка.Дата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), 
	                                   Найти(Формат(Выборка.Дата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'",КодЯзыкаПечать)), " "));
													 
	Шапка.Параметры.ДеньОснования = День(Выборка.ДокументОснованиеДата);
	
	Шапка.Параметры.МесяцОснования = Сред(Формат(Выборка.ДокументОснованиеДата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), 
	                                  Найти(Формат(Выборка.ДокументОснованиеДата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), " "));
									  
	Шапка.Параметры.ДокументОснованиеНомер	= Выборка.ДокументОснованиеНомер;
		
	ТабДокумент.Вывести(Шапка);
	
	ШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Нумерация	 	= Макет.ПолучитьОбласть("НумерацияКолонок");	
	СтрокаТаблицыДт	= Макет.ПолучитьОбласть("СтрокаТаблицыДт");
	ПодвалТаблицыДт	= Макет.ПолучитьОбласть("ПодвалТаблицыДт");
	СтрокаТаблицыКт	= Макет.ПолучитьОбласть("СтрокаТаблицыКт");
	ПодвалТаблицыКт	= Макет.ПолучитьОбласть("ПодвалТаблицыКт");
	
	// выведем шапку таблицы дебиторы
	ШапкаТаблицы.Параметры.ПараметрКолонки = "дебіторами";
	ШапкаТаблицы.Параметры.ЗаголовокШапки  = "1.  За  дебіторською  заборгованістю";
	ШапкаТаблицы.Параметры.ВидКонтрагента  = "Дебітор";
	ШапкаТаблицы.Параметры.ДтКт  			= "дебіторської";
	ШапкаТаблицы.Параметры.РасходДоход	= "витрати";
	ТабДокумент.Вывести(ШапкаТаблицы);
	ТабДокумент.Вывести(Нумерация);
//	
	ВыборкаПоВидуЗадолженности = РезультатКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаПоВидуЗадолженности.НайтиСледующий(Перечисления.ВидыЗадолженности.Дебиторская, "ВидЗадолженности") Тогда

		ПодвалТаблицыДт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
//		
		ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
		
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			
			СтрокаТаблицыДт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
			
			СтрокаТаблицыДт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
																	ВыборкаПоКонтрагенту.КонтрагентНаименование, ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
																	
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаТаблицыДт) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(Нумерация);
				ТабДокумент.Вывести(СтрокаТаблицыДт);
			Иначе
				ТабДокумент.Вывести(СтрокаТаблицыДт);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ПодвалТаблицыДт);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ШапкаТаблицы.Параметры.ПараметрКолонки = "кредиторами";
	ШапкаТаблицы.параметры.ЗаголовокШапки  = "2.  За  кредиторською  заборгованістю";
	ШапкаТаблицы.Параметры.ВидКонтрагента  = "Кредитор";
	ШапкаТаблицы.Параметры.ДтКт  			= "кредіторської";
	ШапкаТаблицы.Параметры.РасходДоход	= "доходи";
	ТабДокумент.Вывести(ШапкаТаблицы);
	ТабДокумент.Вывести(Нумерация);
	
	ВыборкаПоВидуЗадолженности.Сбросить();
	Если ВыборкаПоВидуЗадолженности.НайтиСледующий(Перечисления.ВидыЗадолженности.Кредиторская, "ВидЗадолженности") Тогда
		
		ПодвалТаблицыКт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
//		
		ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			СтрокаТаблицыКт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
			СтрокаТаблицыКт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
			 													ВыборкаПоКонтрагенту.КонтрагентНаименование, ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
																
			Если НЕ ТабДокумент.ПроверитьВывод(СтрокаТаблицыКт) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(Нумерация);
				ТабДокумент.Вывести(СтрокаТаблицыКт);
			Иначе
				ТабДокумент.Вывести(СтрокаТаблицыКт);
			КонецЕсли;

		КонецЦикла;

		
	КонецЕсли;
	
	ТабДокумент.Вывести(ПодвалТаблицыКт);

//	// Подвал печатной формы
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(Подвал);
	
	Подпись = Макет.ПолучитьОбласть("Подпись");  
	
	Подпись.Параметры.Заполнить(ВыборкаПоКомиссии);
	ТабДокумент.Вывести(Подпись);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьИнвентаризации_2015()

// Процедура формирования унифицированной печатной формы документа ИНВ-17
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма акта инвентаризации.
//
//
Функция ПечатьИнв17() Экспорт
	
	Перем КодЯзыкаПечать, ЗаголовокРазделаПодписей, Выборка, ВыборкаПоКомиссии, РезультатКонтрагенты;
	
	ВыполнитьЗапросыДляПечати(КодЯзыкаПечать,ЗаголовокРазделаПодписей,Выборка,ВыборкаПоКомиссии,РезультатКонтрагенты);
	
	// Варианты заголовков разделов с подписями печатной формы	
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетов_ИНВ17";
	
	Макет = ПолучитьМакет("ИНВ17");
	
	Макет.КодЯзыкаМакета = КодЯзыкаПечать; 	 
	
	// Формирование шапки
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Выборка);
	
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата);
	Шапка.Параметры.Организация	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации,    "ПолноеНаименование,",Ложь,КодЯзыкаПечать);
	Шапка.Параметры.НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	Шапка.Параметры.ДеньДокумента  = День(Выборка.Дата);
	Шапка.Параметры.МесяцДокумента = Сред(Формат(Выборка.Дата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), 
	                                   Найти(Формат(Выборка.Дата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'",КодЯзыкаПечать)), " "));
													 
	Шапка.Параметры.ДеньОснования = День(Выборка.ДокументОснованиеДата);
	Шапка.Параметры.МесяцОснования = Сред(Формат(Выборка.ДокументОснованиеДата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), 
	                                   Найти(Формат(Выборка.ДокументОснованиеДата, "ДЛФ=ДД;"+НСтр("ru='Л=ru';uk='Л=uk'", КодЯзыкаПечать)), " "));
	Шапка.Параметры.ДокументОснованиеНомер = Выборка.ДокументОснованиеНомер;
		
	ТабДокумент.Вывести(Шапка);

	// Формирование строк дебиторской задолженности
	ПодвалТаблицыДт = Макет.ПолучитьОбласть("ПодвалТаблицыДт");
	СтрокаТаблицыДт = Макет.ПолучитьОбласть("СтрокаТаблицыДт");
	
	ВыборкаПоВидуЗадолженности = РезультатКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаПоВидуЗадолженности.НайтиСледующий(Перечисления.ВидыЗадолженности.Дебиторская, "ВидЗадолженности") Тогда

		ПодвалТаблицыДт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
		
		ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			СтрокаТаблицыДт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
			СтрокаТаблицыДт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
				ВыборкаПоКонтрагенту.КонтрагентНаименование, ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
			ТабДокумент.Вывести(СтрокаТаблицыДт);
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ПодвалТаблицыДт);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Шапка оборотной стороны Акта
	ШапкаОборот = Макет.ПолучитьОбласть("ШапкаОборот");
	ТабДокумент.Вывести(ШапкаОборот);
	
	// Формирование строк кредиторской задолженности
	ПодвалТаблицыКт = Макет.ПолучитьОбласть("ПодвалТаблицыКт");
	СтрокаТаблицыКт = Макет.ПолучитьОбласть("СтрокаТаблицыКт");
			
	ВыборкаПоВидуЗадолженности.Сбросить();
	Если ВыборкаПоВидуЗадолженности.НайтиСледующий(Перечисления.ВидыЗадолженности.Кредиторская, "ВидЗадолженности") Тогда
		
		ПодвалТаблицыКт.Параметры.Заполнить(ВыборкаПоВидуЗадолженности);
		
		ВыборкаПоКонтрагенту = ВыборкаПоВидуЗадолженности.Выбрать();
		Пока ВыборкаПоКонтрагенту.Следующий() Цикл
			СтрокаТаблицыКт.Параметры.Заполнить(ВыборкаПоКонтрагенту);
			СтрокаТаблицыКт.Параметры.КонтрагентПредставление = ?(ПустаяСтрока(ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное),
				ВыборкаПоКонтрагенту.КонтрагентНаименование, ВыборкаПоКонтрагенту.КонтрагентНаименованиеПолное);
			ТабДокумент.Вывести(СтрокаТаблицыКт);
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ПодвалТаблицыКт);
	
	// Подвал печатной формы
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(Подвал);
	
	Подпись = Макет.ПолучитьОбласть("Подпись");   	
	
	// Выведем подпись председателя инвентаризационной комиссии
	Подпись.Параметры.ЗаголовокРазделаПодписей = ЗаголовокРазделаПодписей.ПредседательКомиссии;
	Подпись.Параметры.Должность                = ВыборкаПоКомиссии.ПредседательКомиссииДолжность;
	Подпись.Параметры.РасшифровкаПодписи       = ВыборкаПоКомиссии.ПредседательКомиссииФИО;
	
	ТабДокумент.Вывести(Подпись);
	
	// Выведем подписи членов комиссии
	ВыводитьЗаголовок = Истина;
	
	// Сформируем список членов комиссии
	СписокЧленовКомиссии = Новый Массив();	
	
	НаименованиеЧленовКомиссии = Новый Массив;
	НаименованиеЧленовКомиссии.Добавить("ПервыйЧленКомиссии");
	НаименованиеЧленовКомиссии.Добавить("ВторойЧленКомиссии");
	НаименованиеЧленовКомиссии.Добавить("ТретийЧленКомиссии");
	
	// Сначала выведем членов комиссии из выборки
	Для Каждого ЧленКомиссии Из НаименованиеЧленовКомиссии Цикл
		
		Если НЕ ТабДокумент.ПроверитьВывод(Подпись) Тогда
			
			// Выведем разрыв страницы
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
		
		КонецЕсли;
		
		Подпись.Параметры.ЗаголовокРазделаПодписей = ?(ВыводитьЗаголовок, 
		                                               ЗаголовокРазделаПодписей.ЧленыКомиссии,
													   "");
		Подпись.Параметры.Должность                = ВыборкаПоКомиссии[ЧленКомиссии + "Должность"];
		Подпись.Параметры.РасшифровкаПодписи       = ВыборкаПоКомиссии[ЧленКомиссии + "ФИО"];
		
		ТабДокумент.Вывести(Подпись);
		
		ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
		
	КонецЦикла;     	
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьИнв17()     

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Инвентаризация2015" Тогда
		ТабДокумент = ПечатьИнвентаризации_2015();	
	Иначе
		ТабДокумент = ПечатьИнв17();	
	КонецЕсли;
	
	Если НЕ (ТабДокумент = Неопределено) Тогда
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 
			КоличествоЭкземпляров, 
			НаПринтер, 
			ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Метаданные().Представление()), 
			НепосредственнаяПечать);
	КонецЕсли;
	
КонецПроцедуры // Печать

# КонецЕсли 

//	Функция возвращает доступные варианты печати документа
//
//	Значение: Структура вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Инвентаризация2015,ИНВ17",НСтр("ru='Акт инвентаризации (прик. Минфина №572 от 17.06.2015)';uk='Акт інвентаризації (нак. Мінфіна №572 від 17.06.2015)'"),НСтр("ru='ИНВ-17 (акт инвентаризации устаревший)';uk='ІНВ-17 (акт інвентаризації застарілий)'")); 
 
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()
